- StringIO
- Pandas read_csv

In [1]:
from io import StringIO
# StringIO - in memory file object

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('mercedesbenz.csv')

In [5]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [6]:
type(df)

pandas.core.frame.DataFrame

In [9]:
data=('col1,col2,col3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,d,3')

In [10]:
type(data)

str

In [11]:
# in memory File Formate object 
StringIO(data)

In [15]:
 pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [19]:
pd.read_csv(StringIO(data), usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [21]:
df = pd.read_csv('mercedesbenz.csv',usecols=['X0','X1','X2','X3','X4','X5'])
df.head()

   X0 X1  X2 X3 X4 X5
0   k  v  at  a  d  u
1   k  t  av  e  d  y
2  az  w   n  c  d  x
3  az  t   n  f  d  x
4  az  v   n  f  d  h

In [22]:
# av e
# n  c
df.iloc[1:3,2:4]

   X2 X3
1  av  e
2   n  c

In [23]:
df.to_csv('test.csv')

In [26]:
df

      X0 X1  X2 X3 X4  X5
0      k  v  at  a  d   u
1      k  t  av  e  d   y
2     az  w   n  c  d   x
3     az  t   n  f  d   x
4     az  v   n  f  d   h
...   .. ..  .. .. ..  ..
4204  ak  s  as  c  d  aa
4205   j  o   t  d  d  aa
4206  ak  v   r  a  d  aa
4207  al  r   e  f  d  aa
4208   z  r  ae  c  d  aa

[4209 rows x 6 columns]

In [36]:
df.to_csv('test.csv',index=False)

In [37]:
df.head()

   X0 X1  X2 X3 X4 X5
0   k  v  at  a  d  u
1   k  t  av  e  d  y
2  az  w   n  c  d  x
3  az  t   n  f  d  x
4  az  v   n  f  d  h

### Data Types in CSV

In [38]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11')

In [40]:
df1 = pd.read_csv(StringIO(data))
df1

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [42]:
df1.isnull()

       a      b      c      d
0  False  False  False  False
1  False  False  False  False
2  False  False  False   True

In [43]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [58]:
# changing the data type using this -> dtype=''
df1 = pd.read_csv(StringIO(data),dtype='object')
# df1 = pd.read_csv(StringIO(data),dtype='float')

In [59]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [60]:
df1.head()

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [61]:
df1.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [65]:
df1['a']
df1['a'][0]

'1'

In [66]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11')

In [68]:
df = pd.read_csv(StringIO(data),dtype={'a': int, 'b': float, 'c': int})

In [69]:
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      float64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 228.0 bytes

In [71]:
df.dtypes

a      int64
b    float64
c      int64
d    float64
dtype: object

In [72]:
data=('index,a,b,c,d\n'
     '4,apple,bat,5.7\n'
     '8,orrnage,cow,10\n')

In [79]:
pd.read_csv(StringIO(data))
pd.read_csv(StringIO(data),index_col=0)

   index        a    b   c
0      4    apple  bat NaN
1      8  orrnage  cow NaN

In [98]:
# use index columns and usecols
data=('a,b,c\n'
     '4,apple,bat\n'
     '8,orrnage,cow')

In [104]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=0)
pd.read_csv(StringIO(data),usecols=['a','b','c'], index_col=False)

         a    b   c
0    apple  bat NaN
1  orrnage  cow NaN

In [108]:
# pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')           
pd.read_csv('cu.item',sep='\t')

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165

In [ ]:
pd.read_csv('cu.item',sep='\t')